/**
 *******************************************************************************
 * @file    speed-compensater.h
 * @brief   简要描述
 *******************************************************************************
 * @attention
 *
 * none
 *
 *******************************************************************************
 * @note
 *
 * none
 *
 *******************************************************************************
 * @author  MekLi
 * @date    2026/3/14
 * @version 1.0
 *******************************************************************************
 */


/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/

#ifndef INFANTRY_SPEED_COMPENSATER_H
#define INFANTRY_SPEED_COMPENSATER_H



/*-------- 1. includes and imports -----------------------------------------------------------------------------------*/

#include <cmath>
#include <cstdint>




/*-------- 2. enum and define ----------------------------------------------------------------------------------------*/




/*-------- 3. interface ----------------------------------------------------------------------------------------------*/


    class SpeedCompensator {
      public:


        void update(float newInitialSpeed);
        float getCompensatedRadPerSec(float baseRadPerSec) const;
        void reset();

      private:
        float _targetSpeed                   = 23.5f; // 期望压制的安全弹速 (m/s)

        // ==========================================================
        // 关键控制参数
        // ==========================================================
        // 积分增益: 由于加入了均值滤波，单次误差代表的是趋势误差，Ki可以适当放小保证丝滑
        float _ki                            = 3.0f;

        // 死区阈值: 均值误差在 ±0.3m/s 以内时不作调整，防止在目标值附近反复加减速
        float _deadband                      = 0.3f;

        // 极限补偿幅度上限: 最多允许上下浮动 63 rad/s (折合约 600 RPM)
        float _maxCompensation               = 63.0f;

        // ==========================================================
        // 状态与滤波内存
        // ==========================================================
        float _radsCompensation              = 0.0f;
        float _lastInitialSpeed              = 0.0f;

        // 滑动平均滤波器资源 (静态数组实现，0 动态内存分配)
        static constexpr uint8_t FILTER_SIZE = 5; // 采样窗口大小：5 发子弹
        float _filterBuffer[FILTER_SIZE]     = {0};
        uint8_t _filterIndex                 = 0;
        uint8_t _filterCount                 = 0;
        // 上一次更新时间
        uint32_t _lastUpdateTime;
    };




/*-------- 4. decorator ----------------------------------------------------------------------------------------------*/




/*-------- 5. factories ----------------------------------------------------------------------------------------------*/





#endif /*INFANTRY_SPEED_COMPENSATER_H*/
